# Titanic Survivor Prediction
Use your ML Skills to predict who will survive?
Cody and his friends decided to go on a cruise for vacation.Their cruise was named TITANIC-2 and is a complete replica of the famous titanic ship.

<html>
    <div style="width:100%">
        <div style="width:150px;height:150px;margin:auto">
            <img src="https://image.flaticon.com/icons/svg/1167/1167989.svg" >
        </div>
    </div>
</html>

One of Cody's friend is paranoid on boarding the cruise as he recently watched the titanic movie and is certain if the cruise sinks he won't survive.Cody being a good friend, decided to put his friends mind to rest by collecting data from actual titanic accident .Now your job is to develop a model based on data collected by Cody to predict whether a given passenger will survive or not, which Cody will then use to satisfy his friend's curiosity!

Data Description
Dataset Consist of two files "Train.csv" and "Test.csv" you have to train your model on 'Train.csv' and predict the output on 'Tets.csv' ,then submit the output in the form of "sample_submission.csv ".

Data Dictionary
Variable      Definition          Key
------------------------------------------------------------------
survival         Survival           0 = No, 1 = Yes

pclass          Ticket class   1 = 1st, 2 = 2nd, 3 = 3rd

sex                  Sex   

Age                 Age in years   

sibsp        # of siblings / spouses aboard the Titanic  

parch        # of parents / children aboard the Titanic  

ticket        Ticket number   

fare            Passenger fare  

cabin         Cabin number   

embarked    Port of Embarkation    C = Cherbourg, Q = Queenstown, S = Southampton

# Variable Notes
pclass : A proxy for socio-economic status (SES)

1st = Upper

2nd = Middle

3rd = Lower

age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

sibsp: The dataset defines family relations in this way…

Sibling = brother, sister, stepbrother, stepsister

Spouse = husband, wife (mistresses and fiancés were ignored)

parch: The dataset defines family relations in this way…

Parent = mother, father

Child = daughter, son, stepdaughter, stepson

Some children traveled only with a nanny, therefore parch=0 for them.

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv("Train.csv")
X_test=pd.read_csv("Test.csv")

In [3]:
X_test.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,"Flynn, Mr. John Irwin (""Irving"")",male,36.0,0.0,0.0,PC 17474,26.3875,E25,S,5,NaN,"Brooklyn, NY"
1,3.0,"Sage, Miss. Constance Gladys",female,NaN,8.0,2.0,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
2,1.0,"Rood, Mr. Hugh Roscoe",male,NaN,0.0,0.0,113767,50.0000,A32,S,NaN,NaN,"Seattle, WA"
3,2.0,"Gillespie, Mr. William Henry",male,34.0,0.0,0.0,12233,13.0000,NaN,S,NaN,NaN,"Vancouver, BC"
4,2.0,"Collander, Mr. Erik Gustaf",male,28.0,0.0,0.0,248740,13.0000,NaN,S,NaN,NaN,"Helsinki, Finland Ashtabula, Ohio"

In [4]:
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.750,NaN,Q,NaN,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.000,NaN,S,NaN,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.000,NaN,S,9,NaN,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.525,NaN,S,C D,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.250,NaN,Q,16,NaN,NaN

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
pclass       1009 non-null float64
survived     1009 non-null float64
name         1009 non-null object
sex          1009 non-null object
age          812 non-null float64
sibsp        1009 non-null float64
parch        1009 non-null float64
ticket       1009 non-null object
fare         1008 non-null float64
cabin        229 non-null object
embarked     1008 non-null object
boat         374 non-null object
body         98 non-null float64
home.dest    582 non-null object
dtypes: float64(7), object(7)
memory usage: 110.4+ KB

In [5]:
X_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 13 columns):
pclass       300 non-null float64
name         300 non-null object
sex          300 non-null object
age          234 non-null float64
sibsp        300 non-null float64
parch        300 non-null float64
ticket       300 non-null object
fare         300 non-null float64
cabin        66 non-null object
embarked     299 non-null object
boat         112 non-null object
body         23 non-null float64
home.dest    163 non-null object
dtypes: float64(6), object(7)
memory usage: 30.5+ KB

In [7]:
columns_to_drop=['name','ticket','cabin','boat','body','home.dest','embarked']

In [8]:
data_clean=data.drop(columns=columns_to_drop)
Test=X_test.drop(columns=columns_to_drop)

In [9]:
data_clean.head()

   pclass  survived     sex   age  sibsp  parch    fare
0     3.0       0.0  female   NaN    0.0    0.0   7.750
1     2.0       0.0    male  39.0    0.0    0.0  26.000
2     2.0       1.0  female  40.0    0.0    0.0  13.000
3     3.0       1.0  female  31.0    1.0    1.0  20.525
4     3.0       1.0  female   NaN    2.0    0.0  23.250

In [38]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 7 columns):
pclass      1009 non-null float64
survived    1009 non-null float64
sex         1009 non-null object
age         812 non-null float64
sibsp       1009 non-null float64
parch       1009 non-null float64
fare        1008 non-null float64
dtypes: float64(6), object(1)
memory usage: 55.3+ KB

In [10]:
values={'age':data['age'].mean(),'fare':0}
data_clean.fillna(values,inplace=True)
Test.fillna(values,inplace=True)

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
le=LabelEncoder()

In [13]:
data_clean['sex']=le.fit_transform(data_clean['sex'])
Test['sex']=le.fit_transform(Test['sex'])

In [14]:
X_train=data_clean[['pclass', 'sex', 'age', 'sibsp', 'parch', 'fare']]
Y_train=data_clean[['survived']]

In [15]:
from sklearn.tree import DecisionTreeClassifier

In [25]:
dt=DecisionTreeClassifier(criterion='entropy',max_depth=10)

In [26]:
dt.fit(X_train,Y_train)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=10,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [27]:
y_pred=pd.DataFrame(dt.predict(Test),columns=['survived'])

In [19]:
y_pred.head()

   survived
0       0.0
1       0.0
2       0.0
3       0.0
4       0.0

In [28]:
y_pred.to_csv("ans.csv",index_label='Id')